InformationRegisters/СпособыОтраженияРасходовПоНалогам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>СпособыОтраженияРасходовПоНалогам</Name>
			<Comment>Настройка отражения в учете расходов по имущественным налогам</Comment>
			<InformationRegisterPeriodicity>Quarter</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПодразделениеЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражениеВУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтражениеВУСН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидНалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИмущественныхНалогов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ОтражениеВУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ОтражениеВУСН</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Принимаются</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринимаются</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Распределяются</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/СпособыОтраженияРасходовПоНалогам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	ИЛИ Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Заполняет регистр данными по умолчанию на дату начала использования регистра - 2013-01-01.
//
// Параметры:
//  СтатьяЗатрат - СправочникСсылка.СтатьяЗатрат - статья затрат для отражения сумм расходов
//
Процедура ЗаполнитьПоУмолчанию(СтатьяЗатрат) Экспорт

	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда // В подчиненных узлах РИБ не выполняется
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтатьяЗатрат) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачалаИспользованияРегистра = '2013-01-01';
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Настройки.ВидНалога КАК ВидНалога
	|ПОМЕСТИТЬ Настройки
	|ИЗ
	|	РегистрСведений.СпособыОтраженияРасходовПоНалогам КАК Настройки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыИмущественныхНалогов.Ссылка КАК ВидНалога
	|ИЗ
	|	Перечисление.ВидыИмущественныхНалогов КАК ВидыИмущественныхНалогов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Настройки КАК Настройки
	|		ПО Настройки.ВидНалога = ВидыИмущественныхНалогов.Ссылка
	|ГДЕ
	|	Настройки.ВидНалога ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.СпособыОтраженияРасходовПоНалогам.СоздатьНаборЗаписей();
	
	АналитикаЗатрат = Новый Соответствие;
	АналитикаЗатрат.Вставить(
		Тип("ПланСчетовСсылка.Хозрасчетный"),
		ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы);
	АналитикаЗатрат.Вставить(
		ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат,
		СтатьяЗатрат);
	
	АналитикаЗатратДляЗаписи      = УчетЗатрат.АналитикаЗатратДляЗаписи(АналитикаЗатрат);
	АналитикаЗатратНомераСубконто = УчетЗатрат.АналитикаЗатратНомераСубконто(АналитикаЗатратДляЗаписи);
	АналитикаЗатратНомераСубконто.Вставить("ОтражениеВУСН", Перечисления.ОтражениеВУСН.Принимаются);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Запись = НаборЗаписей.Добавить();
		Запись.Период     = ДатаНачалаИспользованияРегистра;
		Запись.ВидНалога  = Выборка.ВидНалога;
		
		Запись.СчетЗатрат = АналитикаЗатратНомераСубконто.Счет;
		Если АналитикаЗатратНомераСубконто.Свойство("Подразделение") Тогда
			Запись.ПодразделениеЗатрат = АналитикаЗатратНомераСубконто.Подразделение;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Запись, АналитикаЗатратНомераСубконто); // Значения Субконто, ОтражениеВУСН
		
	КонецЦикла;
		
	Попытка
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей, Истина, Истина);
	Исключение
		ШаблонСообщения = НСтр("ru = 'Не удалось создать записи по способам отражения расходов по имущественным налогам
                                |%1'", Метаданные.ОсновнойЯзык.КодЯзыка);
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.СпособыОтраженияРасходовПоНалогам,
			, // Данные
			ТекстСообщения);
		ВызватьИсключение;
	КонецПопытки;
		
КонецПроцедуры

// Определяет наиболее частотную статью затрат, используемую в настройке.
// 
// Возвращаемое значение:
//  СправочникСсылка.СтатьяЗатрат
//
Функция ОсновнаяСтатьяЗатрат() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВидСубконтоСтатьяЗатрат.НомерСтроки = 1
	|				ТОГДА Настройки.Субконто1
	|			КОГДА ВидСубконтоСтатьяЗатрат.НомерСтроки = 2
	|				ТОГДА Настройки.Субконто2
	|			КОГДА ВидСубконтоСтатьяЗатрат.НомерСтроки = 3
	|				ТОГДА Настройки.Субконто3
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
	|		КОНЕЦ КАК Справочник.СтатьиЗатрат) КАК СтатьяЗатрат,
	|	КОЛИЧЕСТВО(*) КАК КоличествоЗаписей
	|ИЗ
	|	РегистрСведений.СпособыОтраженияРасходовПоНалогам КАК Настройки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный.ВидыСубконто КАК ВидСубконтоСтатьяЗатрат
	|		ПО Настройки.СчетЗатрат = ВидСубконтоСтатьяЗатрат.Ссылка
	|ГДЕ
	|	ВидСубконтоСтатьяЗатрат.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат)
	|	И (ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ВидСубконтоСтатьяЗатрат.НомерСтроки = 1
	|					ТОГДА Настройки.Субконто1
	|				КОГДА ВидСубконтоСтатьяЗатрат.НомерСтроки = 2
	|					ТОГДА Настройки.Субконто2
	|				КОГДА ВидСубконтоСтатьяЗатрат.НомерСтроки = 3
	|					ТОГДА Настройки.Субконто3
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
	|			КОНЕЦ КАК Справочник.СтатьиЗатрат)) <> ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ВидСубконтоСтатьяЗатрат.НомерСтроки = 1
	|				ТОГДА Настройки.Субконто1
	|			КОГДА ВидСубконтоСтатьяЗатрат.НомерСтроки = 2
	|				ТОГДА Настройки.Субконто2
	|			КОГДА ВидСубконтоСтатьяЗатрат.НомерСтроки = 3
	|				ТОГДА Настройки.Субконто3
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
	|		КОНЕЦ КАК Справочник.СтатьиЗатрат)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоЗаписей УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СтатьяЗатрат;
	Иначе
		Возврат Справочники.СтатьиЗатрат.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
